Revit 2026 API

# IExternalServiceOnServersChanged Method

---
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void OnServersChanged(
	Document document,
	ServerChangeCause cause,
	IList<Guid> oldServers
)
```
```vb
Sub OnServersChanged (
	document As Document,
	cause As ServerChangeCause,
	oldServers As IList(Of Guid)
)
```
```cpp
void OnServersChanged(
	Document^ document,
	ServerChangeCause cause,
	IList<Guid>^ oldServers
)
```
```fsharp
abstract OnServersChanged :
        document : Document *
        cause : ServerChangeCause *
        oldServers : IList<Guid> -> unit
```

#### Parameters

document Document

cause ServerChangeCause

oldServers IListGuid

#### Reference

IExternalService Interface

Autodesk.Revit.DB.ExternalService Namespace